Revit 2027 API
ImageInstance.Width Property
 The width of the ImageInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for width results in a height that is more than 30000 feet because LockProportions is set to true.
ArgumentOutOfRangeException |  When setting this property: The given value for width must be between 0 and 30000 feet.
Remarks
 If LockProportions is true, then changes to the Width will also result in changes to the Height.
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace